<a href="https://colab.research.google.com/github/sabbir179/test2/blob/main/pdSQLPreparation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# import pandas library
import pandas as pd

In [3]:
#import sqllite
import sqlite3

In [4]:
# Create SQL table
create_table = """
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL
); """

In [5]:
#execute the SQL statment
executeSQL = sqlite3.connect(':memory')
executeSQL.execute(create_table)
executeSQL.commit()

In [7]:
# prepare a SQL query
SQL_query = executeSQL.execute('select * from student_score')

In [8]:
# fetch result from the SQLlite database
resulset = SQL_query.fetchall()

In [9]:
#view result (empty data)
resulset

[]

Example

In [10]:
# prepare recods to be inserted into SQL table through SQL Statement
insertSQL = [(10,'Jack', 85, 92),
             (29, 'Tom', 73,89),
             (65, 'Ram', 65,77),
             (5, 'Steve', 55, 91)]

In [12]:
#insert records into SQL table through SQL statement
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [13]:
#prepare SQL qurery
SQL_query = executeSQL.execute("SELECT * from student_score")

In [14]:
#fetch the resultset for the query
resulset = SQL_query.fetchall()

In [15]:
#view the resultset
resulset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.0, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [35]:
#put the records together in dataframe
df_student_recors = pd.DataFrame(resulset,columns=list(zip(*SQL_query.description))[0])

In [36]:
#view the records in pandas dataframe
df_student_recors

   Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.0     77.0
3   5  Steve  55.0     91.0